src/InformationRegisters/ОсобыеУсловияОтсрочки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОсобыеУсловияОтсрочки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДопустимоеЧислоДнейЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРасчетаДней</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчетаДней</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Изготовитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Изготовители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипПоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ОсобыеУсловияОтсрочки/Ext/ManagerModule.bsl
Функция ДействующиеУсловия(ДоговорКонтрагента, ДатаУсловий = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсобыеУсловияОтсрочкиСрезПоследних.Регистратор,
		|	ОсобыеУсловияОтсрочкиСрезПоследних.ДоговорКонтрагента,
		|	ОсобыеУсловияОтсрочкиСрезПоследних.Изготовитель,
		|	ОсобыеУсловияОтсрочкиСрезПоследних.ТипПоставки,
		|	ОсобыеУсловияОтсрочкиСрезПоследних.ДопустимоеЧислоДнейЗадолженности,
		|	ОсобыеУсловияОтсрочкиСрезПоследних.ВидРасчетаДней,
		|	ОсобыеУсловияОтсрочкиСрезПоследних.ДатаОкончания
		|ИЗ
		|	РегистрСведений.ОсобыеУсловияОтсрочки.СрезПоследних(&ДатаУсловий, ДоговорКонтрагента = &ДоговорКонтрагента) КАК ОсобыеУсловияОтсрочкиСрезПоследних
		|ГДЕ
		|	ОсобыеУсловияОтсрочкиСрезПоследних.ДатаОкончания >= &ДатаУсловий";
	
	Запрос.УстановитьПараметр("ДатаУсловий", ?(ДатаУсловий = Неопределено, Дата(1,1,1), ДатаУсловий));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	
	Возврат Запрос.Выполнить();
	
КонецФункции
